<?php

namespace App\DesignPatterns\Fundamental\Interface;

class AboutPattern extends \App\DesignPatterns\AbstractAboutPattern
{
    public function name(): string
    {
        return 'Interface';
    }

    public function description(): string
    {
        return 'Основний шаблон проектування (повторювана архітектурна конструкція), що є загальним методом структурування комп\'ютерних програм для того, щоб їх було простіше зрозуміти. Загалом, інтерфейс - це клас, який забезпечує програмісту простий або більш програмно-специфічний спосіб доступу до інших класів. Інтерфейс може містити набір об\'єктів та забезпечувати просту, високорівневу функціональність для програміста (наприклад, Шаблон Фасад); він може забезпечувати більш чистий або специфічніший спосіб використання складних класів («клас-обгортка»); він може використовуватися як «клей» між двома різними API (Шаблон Адаптер); і для багатьох інших цілей. Іншими типами інтерфейсних шаблонів є: Шаблон делегування, Шаблон компонувальника, і Шаблон міст.';
    }

    public function example()
    {

    }
}
